#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`


```terraform
aws_iam_policy.pichincha_lambdas: Refreshing state... [id=arn:aws:iam::724404050210:policy/pichincha_lambdas_policy_client]
data.aws_caller_identity.current: Reading...
aws_api_gateway_rest_api.pichincha_apigw: Refreshing state... [id=8wpxfzdwe3]
aws_ecr_repository.post["devops"]: Refreshing state... [id=pichincha_devops]
aws_iam_role.pichincha_lambdas: Refreshing state... [id=pichincha_role]
data.aws_caller_identity.current: Read complete after 0s [id=724404050210]
aws_ecr_repository_policy.post["devops"]: Refreshing state... [id=pichincha_devops]
aws_api_gateway_resource.pichincha_resource["devops"]: Refreshing state... [id=cnq8fv]
aws_lambda_function.lambda_functions_client["devops"]: Refreshing state... [id=pichicha-devops-develop]
aws_api_gateway_method.pichincha_method["devops"]: Refreshing state... [id=agm-8wpxfzdwe3-cnq8fv-POST]
aws_api_gateway_method_response.method_response_client["devops"]: Refreshing state... [id=agmr-8wpxfzdwe3-cnq8fv-POST-200]
aws_api_gateway_integration.pichincha_integration["devops"]: Refreshing state... [id=agi-8wpxfzdwe3-cnq8fv-POST]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=cf0q16]
aws_api_gateway_integration_response.integration_response_client["devops"]: Refreshing state... [id=agir-8wpxfzdwe3-cnq8fv-POST-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_function.lambda_functions_client["devops"] has changed
  ~ resource "aws_lambda_function" "lambda_functions_client" {
        id                             = "pichicha-devops-develop"
      + layers                         = []
      + tags                           = {}
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment must be replaced
-/+ resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date      = "2023-03-07T15:03:01Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:724404050210:8wpxfzdwe3/develop" -> (known after apply)
      ~ id                = "cf0q16" -> (known after apply)
      ~ invoke_url        = "https://8wpxfzdwe3.execute-api.us-east-1.amazonaws.com/develop" -> (known after apply)
      ~ stage_description = "Deployed at 796c79ff70b63597e7375edf8fc30ff2c0aa7589" -> "Deployed at d242b63489bc662fcc0edaf890d38483663d4d65" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.pichincha_integration["devops"] will be updated in-place
  ~ resource "aws_api_gateway_integration" "pichincha_integration" {
        id                      = "agi-8wpxfzdwe3-cnq8fv-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:724404050210:function:pichicha-devops-develop/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda_functions_client["devops"] must be replaced
-/+ resource "aws_lambda_function" "lambda_functions_client" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:724404050210:function:pichicha-devops-develop" -> (known after apply)
      ~ function_name                  = "pichicha-devops-develop" -> "pichincha-devops-develop" # forces replacement
      ~ id                             = "pichicha-devops-develop" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:724404050210:function:pichicha-devops-develop/invocations" -> (known after apply)
      ~ last_modified                  = "2023-03-07T15:02:32.122+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:724404050210:function:pichicha-devops-develop:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:724404050210:function:pichicha-devops-develop:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "597c7ea8743eb33ebc785bd4ba493575bc2b72018c023511c30a9a75a5e5294a" -> (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }
    }

  # aws_lambda_permission.apigw_lambda_client["devops"] will be created
  + resource "aws_lambda_permission" "apigw_lambda_client" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pichincha-devops-develop"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:724404050210:8wpxfzdwe3/*/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "bucket_client_name" but a
value was found in file "../variables/develop.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```


*Pusher: @santacruzpedro, Action: `pull_request`, Working Directory: `terraform/`, Workflow: `CI Terraform`*